{
  "personalInfo": {
    "name": "Vidyullatha KS",
    "title": "Product Manager | Data Analyst | Business Systems Analyst",
    "mainTagline": "I turn complex business problems into clear product strategies and data-driven solutions. With 4+ years at HPE and a Master's in Engineering/Business Management, I bridge technical execution and strategic thinking—delivering measurable impact through analytics, product development, and cross-functional leadership.",
    "university": "George Washington University",
    "location": "Alexandria, VA",
    "photo": "/images/profile-photo.jpeg"
  },
  "pageIntros": {
    "skills": "Combining technical expertise in data analytics, product management, and software development with strategic business acumen to deliver solutions that drive measurable results.",
    "experience": "Progressive career trajectory from Software Designer to Product Manager, consistently delivering quantifiable impact: 47% faster queries, 35% efficiency gains, 45% engagement growth, and products adopted by hundreds of users.",
    "education": "",
    "projects": "End-to-end projects demonstrating product thinking, analytical rigor, and technical execution—from market research studies informing pricing strategy to AI-powered workflow automation.",
    "about": "",
    "contact": ""
  },
  "about": {
    "intro": "Product-minded professional with a proven ability to translate user needs into technical solutions that deliver business value. Currently completing my Master's in Engineering/Business Management at George Washington University while driving student engagement programs that have increased participation by 30% and attendance by 45%.",
    "background": "I spent four years at Hewlett Packard Enterprises building analytics platforms, optimizing data pipelines, and working with product teams to ship features that moved business metrics. My graduate work combines technical depth (Python, SQL, R) with business strategy (product management, marketing analytics, decision science)—positioning me at the intersection where data meets product.",
    "professionalBackground": "At HPE, I advanced from Software Designer I to II by consistently delivering impact: I reduced query time by 47%, eliminated 8 hours of manual reporting weekly, and developed a POC that validated 30% performance improvements and secured executive buy-in for full-scale implementation. My current role extends this track record—I launched a 0-to-1 coaching program for 25+ student leaders, automated nomination processes with VBA, and drove 45% attendance growth through data-informed marketing strategies.",
    "careerObjectives": "Seeking Product Manager, Business Systems Analyst, Data Analyst, or Project Manager roles where I can apply my technical background and product thinking to solve real business problems. I thrive in environments that value analytical rigor, user research, and cross-functional collaboration.",
    "interests": [
      "Product Management: Building 0-to-1 products, conducting user research, prioritizing roadmaps, and shipping features that users actually want",
      "Data Analytics: Using SQL, Python, and R to uncover insights, build dashboards, and inform strategic decisions",
      "Business Systems Analysis: Gathering requirements, documenting processes, identifying gaps, and translating business needs into technical specifications",
      "AI & Automation: Leveraging AI tools (Claude, n8n) to build intelligent workflows and solve problems faster",
      "Process Improvement: Finding inefficiencies, designing solutions, and delivering measurable efficiency gains"
    ]
  },
  "education": [
    {
      "degree": "MS in Engineering/Business Management",
      "institution": "George Washington University",
      "location": "Washington, DC",
      "period": "Jan 2024 - Dec 2025",
      "gpa": "3.88",
      "coursework": [
        "Product Management",
        "Program and Project Management",
        "Marketing Analytics for Design Decisions (R)",
        "Programming for Analytics (Python)",
        "Introduction to Data Science (R)",
        "Database Management Systems (AWS)",
        "Design Thinking"
      ],
      "skills": [
        "Product strategy and roadmap planning",
        "Data analysis and statistical modeling",
        "Project management methodologies",
        "Python and R programming",
        "Database design and SQL",
        "User research and design thinking"
      ]
    },
    {
      "degree": "Bachelor of Engineering, Computer and Information Science",
      "institution": "Dayananda Sagar College of Engineering",
      "location": "Bengaluru, India",
      "period": "Aug 2015 - May 2019",
      "gpa": "8.98/10",
      "coursework": [
        "Data Structures and Algorithms",
        "Database Systems",
        "Software Engineering",
        "Computer Networks",
        "Operating Systems"
      ],
      "skills": [
        "Programming fundamentals",
        "Software development",
        "Systems design",
        "Technical problem-solving",
        "Algorithm design"
      ]
    }
  ],
  "professionalDevelopment": [
    "Leadership Foundations: Leadership Styles and Models (LinkedIn Learning)",
    "Product Management First Steps (LinkedIn Learning)",
    "Becoming a Product Manager: A Complete Guide (LinkedIn Learning)",
    "Generative AI for Product Managers (LinkedIn Learning)"
  ],
  "experience": [
    {
      "position": "Student Program Coordinator",
      "company": "George Washington School of Business",
      "location": "Washington, DC",
      "period": "Jan 2025 - Present",
      "logo": "GWU",
      "responsibilities": [
        "Drove product strategy for student engagement programs through user research (surveys, 1:1 interviews with 50+ students) and feedback analysis, identifying unmet needs that improved participation by 30%",
        "Launched 0-to-1 coaching product after identifying gap through stakeholder interviews with 25+ student leaders; defined MVP features (conflict resolution, event planning templates), delivered in 8-week sprint cycle",
        "Owned go-to-market strategy for signature events, defining target user segments, crafting messaging aligned with student needs, and iterating based on engagement metrics—increased attendance 45%",
        "Automated nominee anonymization process using Qualtrics and Excel VBA for Student Leadership Awards, eliminating bias and reducing manual work",
        "Led Agile project management practices—daily standups, bi-weekly sprint reviews, and clear task breakdowns to keep projects on schedule"
      ],
      "achievements": [
        "30% increase in student participation through data-driven program design",
        "45% attendance growth via targeted go-to-market strategy",
        "Launched coaching program from 0-to-1 serving 25+ leaders",
        "Automated critical workflows saving hours of manual processing"
      ]
    },
    {
      "position": "Software Designer II",
      "company": "Hewlett Packard Enterprise",
      "location": "Bengaluru, India",
      "period": "Mar 2023 - Nov 2023",
      "logo": "HPE",
      "responsibilities": [
        "Led product strategy initiative analyzing user pain points through customer feedback and usage analytics; prioritized roadmap to reduce quote processing time 15%, directly impacting revenue cycle",
        "Owned end-to-end POC product development (requirements gathering → MVP definition → stakeholder reviews → iteration); incorporated user feedback across 4 sprint cycles, validated 30% performance improvement, securing executive buy-in",
        "Enhanced product scalability by designing a process framework for large-scale data ingestion and analytics, increasing operational efficiency by 35%",
        "Conducted competitive landscape analysis for analytics tooling, evaluated 5 vendor solutions against internal requirements, presented findings to product leadership influencing build vs. buy decision",
        "Drove cross-functional alignment across engineering, product, and operations to deliver key features from concept to deployment in Agile sprints"
      ],
      "achievements": [
        "15% reduction in quote processing time through product strategy alignment",
        "30% performance improvement validated through POC development",
        "35% efficiency gain via scalable data framework design",
        "Influenced major build vs. buy decision through competitive analysis"
      ]
    },
    {
      "position": "Software Designer I",
      "company": "Hewlett Packard Enterprise",
      "location": "Bengaluru, India",
      "period": "Feb 2019 - Mar 2023",
      "logo": "HPE",
      "responsibilities": [
        "Partnered with product team to define success metrics and built automated KPI dashboards that became single source of truth for product performance, eliminating 8 hours/week manual reporting and surfacing insights that reduced operational waste 20%",
        "Improved performance visibility and KPI accuracy by optimizing backend data pipelines using SQL and Snowflake, reducing query time by 47%",
        "Collaborated with engineering, product, and sales teams to identify bottlenecks and implement process improvements that increased system efficiency by 40%",
        "Built and maintained dashboards using Power BI and SQL to monitor key product and operational metrics"
      ],
      "achievements": [
        "47% reduction in query execution time through SQL optimization",
        "8 hours per week manual reporting eliminated via automation",
        "20% operational waste reduction through data-driven insights",
        "40% system efficiency improvement through cross-team collaboration"
      ]
    },
    {
      "position": "Product Management Intern",
      "company": "Marvelsoft Solutions",
      "location": "Bengaluru, India",
      "period": "Jun 2018 - Aug 2018",
      "logo": "Intern",
      "responsibilities": [
        "Conducted user research (interviews, surveys) and implemented UI/UX improvements, increasing user satisfaction by 60%",
        "Designed and developed a Tableau dashboard for a SaaS company, tracking customer behavior patterns and KPIs, contributing to a 30% increase in retention rates"
      ],
      "achievements": [
        "60% user satisfaction improvement through research-driven UX enhancements",
        "30% retention increase via analytics dashboard implementation"
      ]
    }
  ],
  "skills": {
    "technical": [
      {
        "name": "Product Management",
        "description": "Product strategy & roadmap, user research & discovery, feature prioritization, cross-functional leadership, product analytics & KPIs, Agile/Scrum methodologies",
        "level": "advanced"
      },
      {
        "name": "Data Analysis",
        "description": "SQL (complex queries, optimization), Python (Pandas, NumPy), R (statistical analysis), data visualization, ETL processes, KPI development",
        "level": "expert"
      },
      {
        "name": "Business Intelligence Tools",
        "description": "Power BI, Tableau, Qlik—building dashboards, automated reports, and data visualization solutions that drive decision-making",
        "level": "expert"
      },
      {
        "name": "Databases & Cloud",
        "description": "MySQL, SAP HANA, Vertica, HDFS, NoSQL, Snowflake, AWS, Azure—designing data architectures and optimizing performance",
        "level": "advanced"
      },
      {
        "name": "Programming & Automation",
        "description": "Python, R, SQL, Advanced Excel (VBA, VLOOKUP, Power Query)—building analytical pipelines and automating workflows",
        "level": "advanced"
      },
      {
        "name": "AI Tools",
        "description": "Claude API, n8n workflow automation, LLM-based semantic analysis—building intelligent systems and AI-powered workflows",
        "level": "intermediate"
      }
    ],
    "management": [
      {
        "name": "Agile/Scrum",
        "description": "Sprint planning, user stories, backlog prioritization, daily standups, retrospectives, cross-functional team collaboration",
        "level": "advanced"
      },
      {
        "name": "Project Management",
        "description": "Project planning & execution, stakeholder management, risk management, timeline & budget tracking, RACI matrices",
        "level": "advanced"
      },
      {
        "name": "Business Systems Analysis",
        "description": "Requirements gathering, process modeling, gap analysis, documentation, stakeholder interviews, UAT coordination",
        "level": "advanced"
      },
      {
        "name": "User Research",
        "description": "Conducting interviews and surveys, synthesizing feedback, identifying user needs, UI/UX optimization",
        "level": "advanced"
      }
    ],
    "soft": [
      {
        "name": "Strategic Thinking",
        "description": "Connecting business goals to technical execution, making data-informed decisions, identifying opportunities for improvement",
        "level": "advanced"
      },
      {
        "name": "Communication",
        "description": "Translating technical concepts for non-technical audiences, presenting to stakeholders, writing clear documentation",
        "level": "expert"
      },
      {
        "name": "Problem Solving",
        "description": "Breaking down complex problems, analyzing root causes, designing practical solutions with measurable impact",
        "level": "expert"
      },
      {
        "name": "Leadership",
        "description": "Coaching and mentoring, facilitating alignment, driving consensus, building high-performing teams",
        "level": "advanced"
      }
    ],
    "tools": [
      {
        "name": "Project Management",
        "description": "Jira, Asana, MS Project, Confluence, Trello—managing sprints, tracking progress, coordinating teams",
        "level": "advanced"
      },
      {
        "name": "Analytics Platforms",
        "description": "Power BI, Tableau, Qlik, Google Analytics—creating dashboards, visualizing data, tracking KPIs",
        "level": "expert"
      },
      {
        "name": "Collaboration Tools",
        "description": "Microsoft 365 (Teams, SharePoint, Outlook), Slack, Qualtrics—facilitating communication and knowledge sharing",
        "level": "advanced"
      },
      {
        "name": "Development Tools",
        "description": "Git/GitHub, VS Code, Jupyter Notebooks—version control, code development, data analysis workflows",
        "level": "intermediate"
      }
    ]
  },
  "projects": [
    {
      "title": "Mobile AI Functionality Market Research",
      "type": "Academic Project | GWU",
      "description": "Led market research study (n=200 consumers) analyzing willingness-to-pay for mobile AI features. Applied conjoint analysis to quantify price elasticity and feature preferences. Delivered pricing recommendation ($9.99/month optimal tier) and feature roadmap adopted by project stakeholders for go-to-market planning.",
      "skills": ["Product Management", "Market Research", "Statistical Analysis", "Pricing Strategy"],
      "date": "Fall 2024",
      "link": "https://madd.seas.gwu.edu/showcase/2024-Fall/mobile-ai.html"
    },
    {
      "title": "Agentic AI Job Search Optimizer",
      "type": "Personal Project",
      "description": "Architected an agentic AI workflow using n8n, Claude API, and Python to autonomously aggregate job listings and perform semantic matching against my resume. Implemented conditional logic, API integrations, and data parsing to filter 1,000+ listings down to high-fit opportunities, optimizing the search process by eliminating noise.",
      "skills": ["AI/ML", "Workflow Automation", "Python", "API Integration"],
      "date": "Jan 2026"
    },
    {
      "title": "Cobalt Supply Chain Sustainability Analysis",
      "type": "Academic Project | GWU",
      "description": "Led analysis of the cradle-to-gate cobalt supply chain, coordinating scenario modeling and risk assessments. Built a decision-support dashboard in Tableau to communicate cost, emission, and supply-risk insights to stakeholders. Applied quantitative methods to identify optimization opportunities in critical mineral pathways.",
      "skills": ["Data Analysis", "Supply Chain", "Tableau", "Sustainability"],
      "date": "Fall 2024"
    },
    {
      "title": "Analytics Platform POC",
      "type": "Professional Project | HPE",
      "description": "Owned end-to-end POC development for analytics platform: gathered requirements from stakeholders, defined MVP scope, conducted sprint planning, integrated advanced analytics tools, and delivered performance testing results. Validated 30% processing capability increase, securing executive buy-in for $500K+ production rollout.",
      "skills": ["Product Management", "Requirements Analysis", "POC Development", "Stakeholder Management"],
      "date": "2023"
    }
  ],
  "contact": {
    "intro": "I'm actively seeking Product Manager, Business Systems Analyst, Data Analyst, and Project Manager opportunities where I can apply my technical background and product thinking to solve real business problems.",
    "availability": "Graduating from George Washington University in December 2025. Open to full-time roles starting early 2026, as well as contract/consulting opportunities.",
    "availabilityOptions": [
      "Product Manager roles (Associate/Entry-Mid Level) - Building products, conducting user research, defining roadmaps",
      "Business Systems Analyst positions - Gathering requirements, documenting processes, bridging business and technical teams",
      "Data Analyst opportunities - SQL, Python, dashboards, analytics, insights that drive decisions",
      "Project Manager roles - Agile/Scrum, stakeholder management, delivery execution"
    ],
    "responseTime": "I typically respond within 24-48 hours. For urgent opportunities, please mention it in your subject line."
  },
  "social": {
    "email": "vidyullatha1997@gmail.com",
    "linkedin": "https://linkedin.com/in/vidyullatha-ks",
    "github": "https://github.com/vidyullathaks",
    "instagram": "https://instagram.com/vidyullathaks"
  },
  "footer": {
    "copyright": "© 2025 Vidyullatha KS. All rights reserved."
  }
}
